/*! @file
********************************************************************************
<PRE>
模块名 : 关键帧
文件名 : MiddleKeyFrames.h 
相关文件 : MiddleKeyFrames.cpp
文件实现功能 : 中间关键帧类声明
作者 : C.L.Wang
Email: morndragon@126.com
版本 : 1.0
--------------------------------------------------------------------------------
多线程安全性 : 是
异常时安全性 : 是
--------------------------------------------------------------------------------
备注 : 无
--------------------------------------------------------------------------------
修改记录 :  
日 期              版本   修改人         修改内容 
2014/03/27    1.0    C.L.Wang        创建
</PRE>
********************************************************************************

* 版权所有(c) C.L.Wang, 保留所有权利

*******************************************************************************/ 

#pragma once

#include "KeyFrames.h"

//视频检测命名空间
namespace vd 
{
	/*! @class
	********************************************************************************
	<PRE>
	类名称 : MiddleKeyFrames
	功能 : 中间关键帧
	异常类 : 无
	--------------------------------------------------------------------------------
	备注 : 无
	典型用法 : MiddleKeyFrames iMKF;
	--------------------------------------------------------------------------------
	作者 : C.L.Wang
	</PRE>
	*******************************************************************************/
	class MiddleKeyFrames : public KeyFrames
	{

	public:

		MiddleKeyFrames (void); //构造函数

		explicit MiddleKeyFrames (
			const std::string& _videoName, 
			const std::size_t  _shotInterval = 200, 
			const std::size_t _beg = 0, 
			const std::size_t _end = UINT_MAX
		); //参数构造函数

		~MiddleKeyFrames(); //析构函数

	public:

		const bool extractKeyFrames (void) override; //提取特征

	private:

		static const std::size_t FIXED_HIGHT = 400; //图像缩放高度
	};

}